```terraform
data.aws_ssm_parameter.route53_hosted_zone: Reading...
data.aws_region.current: Reading...
module.vpc.data.aws_vpc.default: Reading...
module.ec2.aws_key_pair.bastion[0]: Refreshing state... [id=production-bastion_key_pair]
module.app[0].aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E1JTHK618JSRJJ]
module.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/production/rds/db_username]
module.sqs.aws_sqs_queue.question_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/production-question-generation-processor-queue]
module.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=production-AccessToken]
module.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/production/rds/db_password]
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.dynamodb.aws_dynamodb_table.interview_access_token: Refreshing state... [id=production-InterviewAccessToken]
module.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/production-checklist-generation-processor-queue]
data.aws_ssm_parameter.route53_hosted_zone: Read complete after 0s [id=/terraform/shared/route53/hosted_zone]
module.ec2.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b01cbd24c86916f4]
module.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/production-checklist-evaluation-processor-queue]
module.vpc.aws_vpc.main[0]: Refreshing state... [id=vpc-0a33f8829e4b7ad11]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=791901361445]
module.api.aws_api_gateway_rest_api.default: Refreshing state... [id=lnd8c7h9oh]
data.aws_ssm_parameter.route53_zone_id: Reading...
module.route53[0].data.aws_route53_zone.main: Reading...
module.sqs.aws_ssm_parameter.question_generation_processor_queue_arn: Refreshing state... [id=/terraform/production/sqs/question_generation_processor_queue_arn]
module.sqs.aws_ssm_parameter.question_generation_processor_queue_url: Refreshing state... [id=/terraform/production/sqs/question_generation_processor_queue_url]
data.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/terraform/shared/route53/zone_id]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/production/sqs/checklist_generation_processor_queue_url]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/production/sqs/checklist_generation_processor_queue_arn]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/production/sqs/checklist_evaluation_processor_queue_arn]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/production/sqs/checklist_evaluation_processor_queue_url]
aws_ssm_parameter.domain_name: Refreshing state... [id=/terraform/production/domain_name]
module.app[0].aws_s3_bucket.www: Refreshing state... [id=www.app.matchya.ai]
module.app[0].aws_s3_bucket.main: Refreshing state... [id=app.matchya.ai]
module.api.aws_acm_certificate.api[0]: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/39437fb7-9005-4189-b507-1ea9272559ab]
module.api.aws_api_gateway_resource.health: Refreshing state... [id=brgrxn]
module.route53[0].data.aws_route53_zone.main: Read complete after 0s [id=Z0419438LZ88EPNOCFMA]
module.api.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/production/api_gateway/root_resource_id]
module.api.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/production/api_gateway/id]
module.api.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-lnd8c7h9oh-DEFAULT_5XX]
module.api.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-lnd8c7h9oh-UNAUTHORIZED]
module.api.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-lnd8c7h9oh-DEFAULT_4XX]
module.api.aws_api_gateway_method.health_get: Refreshing state... [id=agm-lnd8c7h9oh-brgrxn-GET]
module.api.aws_api_gateway_integration.health_get: Refreshing state... [id=agi-lnd8c7h9oh-brgrxn-GET]
module.vpc.data.aws_vpc.default: Read complete after 1s [id=vpc-02b04f5cc72d62471]
module.api.aws_api_gateway_deployment.default: Refreshing state... [id=71a2ef]
module.api.aws_route53_record.cert_validation_api["api.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__2fa963ca2b81be0eef31b679ef111251.api.matchya.ai._CNAME]
module.app[0].aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.app.matchya.ai]
module.app[0].aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.app.matchya.ai]
module.app[0].aws_s3_bucket_public_access_block.main: Refreshing state... [id=app.matchya.ai]
module.app[0].aws_s3_bucket_website_configuration.main: Refreshing state... [id=app.matchya.ai]
module.app[0].aws_acm_certificate.app: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/c9b6dead-d296-48ca-b4e7-5618db48570c]
module.app[0].aws_s3_bucket_policy.main: Refreshing state... [id=app.matchya.ai]
module.api.aws_acm_certificate_validation.api[0]: Refreshing state... [id=2024-02-11 04:59:27.281 +0000 UTC]
module.app[0].aws_route53_record.cert_validation["www.app.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__1e00e1bfa0fba0722bea3323f52c2435.www.app.matchya.ai._CNAME]
module.app[0].aws_route53_record.cert_validation["app.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__e5b0c1162a18b3e11a6e128d8457f1cc.app.matchya.ai._CNAME]
module.vpc.aws_ssm_parameter.vpc_id: Refreshing state... [id=/terraform/production/vpc/id]
module.vpc.aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-0eea07d0caa19fcc0]
module.vpc.aws_subnet.private_1[0]: Refreshing state... [id=subnet-042b88b86f1ae35b1]
module.vpc.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0ba161e3fcda337b6]
module.vpc.aws_security_group.rds_postgres_secure[0]: Refreshing state... [id=sg-04fd2f788904ef89d]
module.vpc.aws_security_group.lambda: Refreshing state... [id=sg-0b3ddb35f99147ec8]
module.vpc.aws_security_group.ec2_public: Refreshing state... [id=sg-0e8d03eee63e90ed1]
module.vpc.aws_subnet.private_2[0]: Refreshing state... [id=subnet-00db903e62a8b5725]
module.vpc.aws_subnet.public_1[0]: Refreshing state... [id=subnet-0db0002a2e42a0dfd]
module.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-0437d99ad4da5dd3d]
module.vpc.aws_subnet.public_2[0]: Refreshing state... [id=subnet-07f0eb4a4e152086a]
module.api.aws_api_gateway_domain_name.default[0]: Refreshing state... [id=api.matchya.ai]
module.app[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2024-02-11 02:51:36.261 +0000 UTC]
module.vpc.aws_ssm_parameter.subnet_private_1[0]: Refreshing state... [id=/terraform/production/vpc/subnet_id/private_1]
module.vpc.aws_ssm_parameter.subnet_private_2[0]: Refreshing state... [id=/terraform/production/vpc/subnet_id/private_2]
module.vpc.aws_ssm_parameter.security_group_lambda: Refreshing state... [id=/terraform/production/vpc/security_group_id/lambda]
module.vpc.aws_security_group.vpc_endpoint[0]: Refreshing state... [id=sg-07933d80f7b0a8fb7]
module.api.aws_route53_record.api[0]: Refreshing state... [id=Z0419438LZ88EPNOCFMA_api.matchya.ai_A]
module.api.aws_api_gateway_base_path_mapping.default[0]: Refreshing state... [id=api.matchya.ai/]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0e56c404a74bdf4e1]
module.vpc.aws_ssm_parameter.subnet_public_2: Refreshing state... [id=/terraform/production/vpc/subnet_id/public_2]
module.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=production]
module.app[0].aws_cloudfront_distribution.www: Refreshing state... [id=E3SC4UCUUH5OBY]
module.app[0].aws_cloudfront_distribution.main: Refreshing state... [id=E755JG2IWKNS4]
module.vpc.aws_ssm_parameter.subnet_public_1: Refreshing state... [id=/terraform/production/vpc/subnet_id/public_1]
module.vpc.aws_nat_gateway.nat[0]: Refreshing state... [id=nat-0775ebf3282cee113]
module.ec2.aws_instance.bastion[0]: Refreshing state... [id=i-0fa9dc8d76d1d6384]
module.vpc.aws_route_table_association.public_2[0]: Refreshing state... [id=rtbassoc-00e9c8b4c01f1c6b8]
module.vpc.aws_route_table_association.public_1[0]: Refreshing state... [id=rtbassoc-0f49c69e744a26193]
module.app[0].aws_ssm_parameter.www_cloud_distribution_url: Refreshing state... [id=/terraform/production/cloudfront/url/www.app.matchya.ai]
module.app[0].aws_ssm_parameter.cloudfront_distribution_id: Refreshing state... [id=/terraform/production/app.matchya.ai/cloudfront_distribution_id]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0420cee37c44e3693]
module.app[0].aws_ssm_parameter.cloud_distribution_url: Refreshing state... [id=/terraform/production/cloudfront/url/app.matchya.ai]
module.app[0].aws_route53_record.www_app: Refreshing state... [id=Z0419438LZ88EPNOCFMA_www.app.matchya.ai_A]
module.app[0].aws_route53_record.app: Refreshing state... [id=Z0419438LZ88EPNOCFMA_app.matchya.ai_A]
module.vpc.aws_route_table_association.private_1[0]: Refreshing state... [id=rtbassoc-0b062a87225a2ca89]
module.vpc.aws_route_table_association.private_2[0]: Refreshing state... [id=rtbassoc-0451256df87ec234a]
module.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-7WE4QNZAYDEMXWW5JKTA3TSOIA]
module.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/production/rds/endpoint]
module.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/production/rds/port]
module.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/production/rds/db_name]
module.ec2.aws_eip.bastion[0]: Refreshing state... [id=eipalloc-0f40d9024e5455f5c]
module.ec2.aws_ssm_parameter.bastion_ip[0]: Refreshing state... [id=/terraform/production/ec2/elastic_ip/bastion_host]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.api.aws_api_gateway_base_path_mapping.default[0] will be updated in-place
  ~ resource "aws_api_gateway_base_path_mapping" "default" {
        id          = "api.matchya.ai/"
      ~ stage_name  = "production" -> "default"
        # (2 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_deployment.default must be replaced
-/+ resource "aws_api_gateway_deployment" "default" {
      ~ created_date  = "2024-02-12T00:06:00Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:791901361445:lnd8c7h9oh/production" -> (known after apply)
      ~ id            = "71a2ef" -> (known after apply)
      ~ invoke_url    = "https://lnd8c7h9oh.execute-api.us-east-1.amazonaws.com/production" -> (known after apply)
      ~ stage_name    = "production" -> "default" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.app[0].aws_ssm_parameter.cloudfront_distribution_id must be replaced
-/+ resource "aws_ssm_parameter" "cloudfront_distribution_id" {
      ~ arn            = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/production/app.matchya.ai/cloudfront_distribution_id" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ id             = "/terraform/production/app.matchya.ai/cloudfront_distribution_id" -> (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      ~ name           = (sensitive value) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.rds.aws_db_instance.secure[0] will be updated in-place
  ~ resource "aws_db_instance" "secure" {
      ~ final_snapshot_identifier             = "production-final-snapshot-2024-02-12-00-05-59" -> (known after apply)
        id                                    = "db-7WE4QNZAYDEMXWW5JKTA3TSOIA"
        tags                                  = {
            "Environment" = "production"
        }
        # (52 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: environment.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "environment.tfplan"

```